app/controllers/answers_controller.rb

  def create
    @answer = Answer.new(answer_params)

    if @answer.save
      redirect_to question_path(params[:question_id])
    else
      @question = Question.find(params[:question_id])
---
INSERT INTO "answers" ("description", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 215]]

  def update
    @answer = Answer.find(params[:id])
    @question = @answer.question_id

    Question.find(@question).answers.each do |answer|
      if answer.best_answer == true
        answer.update(best_answer: false)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 3]]
UPDATE "answers" SET "best_answer" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["best_answer", "t"], ["updated_at", "2015-06-25 18:55:53.160080"], ["id", 2]]