app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC
---
  def index
    @questions = Question.order(created_at: :desc)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 38]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."created_at" DESC  [["question_id", 354]]
---
  def show
    @question = Question.find(params[:id])
    @answer = Answer.new
    @answers = Answer.where(question_id: params[:id]).order(created_at: :asc)

INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @question = Question.new(question_params)

    unless user_signed_in?
      flash[:notice] = "You need to be signed in to ask a question."
      redirect_to new_user_session_path
    end

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 476]]
---
  def edit
    if user_signed_in?
      @question = Question.find(params[:id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 556]]
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = $3
---
  def update
    unless user_signed_in?
      flash[:notice] = "You need to be signed in to ask a question."
      redirect_to new_user_session_path
    end

    @question = Question.find(params[:id])

    if @question.update(question_params)