app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
    @body = Redcarpet::Markdown.new(Redcarpet::Render::HTML).render(@question.body)
    @answer = Answer.new
    @answers = Answer.where(question_id: params[:id]).order(best_answer: :desc, created_at: :asc)
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."best_answer" DESC, "answers"."created_at" ASC  [["question_id", 3]]